<template>
  <div class="content container-fluid">
    <div class="row">
      <div class="content_title col-sm-12">
        <h2 :id="id">About Me</h2>
      </div>
      <div class="col-sm-4 content_image">
        <img
          class="img-fluid img-thumbnail mh-100 mx-auto d-block"
          src="../../assets/image/my-img.jpg"
          alt=""
        />
      </div>
      <div class="col-sm-6">
        <div class="row">
          <div class="col-sm-12 content_profile">
            <h3>プロフィール</h3>
            <p>岩原 公貴（いわはら こうき）</p>
            <p>誕生日: 1986年7月12日生（33歳）</p>
            <p>趣味: 料理、ボルダリング</p>
            <p>
              Twitter:
              <a href="https://twitter.com/iwaharasan" target="”_blank”"
                >@iwaharasan</a
              >
            </p>
            <p>
              Qiita:
              <a href="https://qiita.com/kouki-iwahara" target="”_blank”"
                >https://qiita.com/kouki-iwahara</a
              >
            </p>
            <p>
              GitHub:
              <a href="https://github.com/kouki-iwahara" target="”_blank”"
                >https://github.com/kouki-iwahara</a
              >
            </p>
            <p>
              Contact:
              <a href="mailto:19860712kouki@gmail.com">Email</a>
            </p>
          </div>
        </div>
      </div>
      <div class="content_groupe col-sm-10">
        <h3>経歴</h3>
        <div class="content_career">
          <p>・2005年3月 新潟県立新潟西高等学校卒業</p>
          <p>・2007年6月 駿河台大学 経済学部経済学科中退</p>
          <p>・2007年7月 株式会社 はちもんフード 就職(外食産業)</p>
          <div>
            <p>
              「地域の貢献と従業員の幸せを作る会社」という経営理念に魅力を感じ入社。<br />
              2年目で店長の役職に就任。<br />
              当時の課題は、原価率の高騰でした。<br />
              原因は破棄してしまう食材が出る事。<br />
              この現状に対応すべく、<span
                >みんなで出た良いと思った案をとにかく迅速に実施。</span
              >
              トライ&エラーを繰り返しました。<br />
              その結果、<span
                >原価率が30%だったのに対し28%までダウン。<br />
                さらにその翌月移行、売り上げを3ヶ月連続昨年対比超えという期待以上の成果を得る事ができました。</span
              ><br />
              この会社で、<span>すぐに行動に移し、なぜ失敗したのかを分析・修正する事で大きな成果に繋がる</span>という経験をしました。
            </p>
          </div>
          <p>・2010年8月 株式会社 はちもんフード 退職</p>
          <p>・2010年9月 居酒屋Tommorow 就職(外食産業・個人店)</p>
          <p>
            個人事業主として経営している居酒屋を探し、韓国料理をメインとした独自性のある居酒屋へ就職しました。<br />
            副店長に就任し、多くの問題を改善しました。<br />
            問題の一つとして、コース料理を売っていく戦略がうまく機能していませんでした。<br />
            そこで、お店の作りが個室が多いことを利用し、ターゲットをカップルに絞り、誕生日や記念日コースに力を入れる事を提案。<br />
            その結果、コース予約が徐々に増え、<span
              >提案前の２倍のコース予約をコンスタントに取る事ができました。</span
            ><br />
            <span
              >ターゲットを明確にし、それに合ったサービスを考える事。<br />
              また、既存のものを利用した業務改善・提案をする考え方が身につきました。</span
            >
          </p>
          <p>・2013年10月 居酒屋Tommorow 退職</p>
          <p>・2013年12月 個人事業として フードバーRady 設立</p>
          <p>
            <span>これまでの経験を活かしてフードバーを設立しました。</span
            ><br />
            「全て自由で全て自己責任」という状況に身を置いて仕事をした事は、非常に良い経験をしたと思っています。<br />
            しかし、丸4年で閉店する事になりました。<br />
            失敗から学んだ一番強く残る教訓は、<span
              >「現状維持をしようとすると衰退する」という事です。</span
            ><br />
            当初はお店のメニューを月一回変えたり、BGMのジャンルや小物の配置など試行錯誤しながら取り組んでいました。<br />
            そして2年ほどたった辺りから、メニューを変えずに人気のメニューを選択し固定、店内の雰囲気も変わらずの状態にしました。<br />
            しばらくしてお客様はからいただいた言葉が「なんかこの店変わったね。」でした。<br />
            その1年後、お店を畳むこととなります。<br />
            今思うと、始めた3年目くらいまでは、「いつきても変わらずいい店だね！」
            と言われた事がありました。<br />
            <span
              >ライバル店のレベルが上がっている中、お客様も同時にお店を見る目のレベルが上がります。<br />その結果、変えていないはずのお店が変わったと言われ、変えていた時期はお客様と一緒に成長していたんだなと身にしみてわかりました。</span
            >
          </p>
          <p>・2017年1月 フードバーRady 廃業</p>
          <p>・2017年2月 角中株式会社 就職（外食産業）</p>
          <p>
            店長に就任し、経営の経験と以前の業務の経験から多くのお店を立ち上げマネジメントしました。<br />
            また、<span
              >スタッフの人数が今までの経験で一番多く、チームビルディングに力を入れました。</span
            ><br />
            最も効果が大きかった取り組みが「スタッフ全員、一日一改善の習慣」です。<br />
            「全ての答えは現場にある」をスローガンとし、社長、幹部クラスが各店舗へ偵察。<br />
            その気づきを元に、一日一つで良いから改善していこうという運動です。<br />
            この取り組みの目的は、「みんなで決めた事をみんなでやり遂げる」という強いチームビルディングです。<br />
            途中、面倒臭いとの声も上がりましたが、「どんな些細な事でも良い」と率先して私が改善する姿を見せました。<br />
            <span
              >その結果チームみんなでやり遂げる事ができ、会社での手本となるお店として全店に紹介され表彰されました。</span
            ><br />
            <span
              >この経験は強いチームの土壌を作る要因になり、スタッフも仕事のやりがいを感じる事ができたと思います。</span
            >
          </p>
          <p>・2019年8月 角中株式会社 退職</p>
          <p>
            ・2019年9月~
            <span>プログラマーになる為にポートフォリオ作成開始</span>
          </p>
          <p>・2019年12月~ <span>地元新潟から上京し転職活動開始</span></p>
        </div>
      </div>
      <div class="col-sm-10 content_groupe">
        <h3>今まで取り組んだプログラミングスキル</h3>
        <p>2019年</p>
        <p>1月〜 html,css</p>
        <p>2月〜 JavaScript</p>
        <p>7月〜 Vue.js</p>
        <p>8月〜 Nuxt.js</p>
        <p>8月下旬〜 Node.js,Express.js,MySQL,Jest</p>
        <p>9月中旬〜 Nuxt+Express+MySQLのポートフォリオ作成開始</p>
        <p>11月上旬〜 Docker,CircleCI</p>
        <p>11月下旬〜 AWS</p>
        <p>（成果物は下記参照）</p>
      </div>
      <div class="col-sm-10 content_groupe">
        <h3>どのようなプログラマーを目指しているか</h3>
        <p>
          失敗を恐れずに新しい事にチャレンジする精神を持ち、技術をとことん追求していきたいです。<br />
          そしてその技術を活かして、日常のちょっとした便利を提案し、小さくても幸せを提供していけるようなプログラマーになりたいです。
        </p>
        <p>
          1.周囲を巻き込み変化をもたらす<br />
          ------------------------------------------------------------------------------------------------<br />
          自分自身の成長が多くの人々の役に立てる近道だと思います。<br />
          スキルアップの為の学びを積極的に行い、勉強会の主催等を行い周囲を巻き込んで様々な変化を生み出して行きたいです。
        </p>
        <p>
          2.サービスや事業を作り価値のあるものを生み出す<br />
          ------------------------------------------------------------------------------------------------<br />
          関わる人たちの悩みを解決できるようなサービスを作り、利用してもらいたいです。<br />
          そのサービスで人々の暮らしが豊かになり、尚且つそれが自分の資産になるようなものを生み出していきたいです。
        </p>
        <p>
          3.人を集めるエネルギーを持つ<br />
          ------------------------------------------------------------------------------------------------<br />
          人はエネルギーを感じる人の所へ自然と集まると思っています。<br />
          SNSでの情報発信はもちろん、日常生活でも活発に行動し、関わる人たちにとっての「元気印」になりたいです。<br />
          それが僕の志す幸せの提供に必要な条件だと考えています。
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  props: {
    id: {
      type: String,
      default: null
    }
  }
}
</script>

<style scoped>
.content_title {
  text-align: center;
}

.content_image {
  height: 300px;
}

.content_image,
.content_groupe {
  margin: 0 0 20px auto;
}
span {
  color: red;
}
</style>
